IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_xbar_regs.xml
<module id="EPWM_XBAR_REGS" HW_revision="" description="EPWM XBAR Registers">
	<register id="OUT1MUX0TO15CFG" width="32" page="1" offset="0x0" internal="0" description="ePWM XBAR Mux Configuration for Output1">
		<bitfield id="MUX0" description="MUX0 Configuration for OUT1 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 Configuration for OUT1 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 Configuration for OUT1 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 Configuration for OUT1 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 Configuration for OUT1 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 Configuration for OUT1 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 Configuration for OUT1 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 Configuration for OUT1 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 Configuration for OUT1 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 Configuration for OUT1 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 Configuration for OUT1 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 Configuration for OUT1 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 Configuration for OUT1 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 Configuration for OUT1 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 Configuration for OUT1 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 Configuration for OUT1 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUT1MUX16TO31CFG" width="32" page="1" offset="0x2" internal="0" description="ePWM XBAR Mux Configuration for Output1">
		<bitfield id="MUX16" description="MUX16 Configuration for OUT1 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 Configuration for OUT1 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 Configuration for OUT1 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 Configuration for OUT1 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 Configuration for OUT1 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 Configuration for OUT1 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 Configuration for OUT1 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 Configuration for OUT1 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 Configuration for OUT1 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 Configuration for OUT1 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 Configuration for OUT1 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 Configuration for OUT1 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 Configuration for OUT1 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 Configuration for OUT1 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 Configuration for OUT1 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 Configuration for OUT1 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUT1MUX32TO47CFG" width="32" page="1" offset="0x4" internal="0" description="ePWM XBAR Mux Configuration for Output1">
		<bitfield id="MUX32" description="MUX32 Configuration for TRIP4 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX33" description="MUX33 Configuration for TRIP4 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX34" description="MUX34 Configuration for TRIP4 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX35" description="MUX35 Configuration for TRIP4 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX36" description="MUX36 Configuration for TRIP4 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX37" description="MUX37 Configuration for TRIP4 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX38" description="MUX38 Configuration for TRIP4 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX39" description="MUX39 Configuration for TRIP4 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX40" description="MUX40 Configuration for TRIP4 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX41" description="MUX41 Configuration for TRIP4 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX42" description="MUX42 Configuration for TRIP4 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX43" description="MUX43 Configuration for TRIP4 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX44" description="MUX44 Configuration for TRIP4 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX45" description="MUX45 Configuration for TRIP4 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX46" description="MUX46 Configuration for TRIP4 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX47" description="MUX47 Configuration for TRIP4 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="OUT1MUX48TO63CFG" width="32" page="1" offset="0x6" internal="0" description="ePWM XBAR Mux Configuration for Output1">
		<bitfield id="MUX48" description="MUX48 Configuration for OUT1 of EPWM-XBAR" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="MUX49" description="MUX49 Configuration for OUT1 of EPWM-XBAR" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="MUX50" description="MUX50 Configuration for OUT1 of EPWM-XBAR" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="MUX51" description="MUX51 Configuration for OUT1 of EPWM-XBAR" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="MUX52" description="MUX52 Configuration for OUT1 of EPWM-XBAR" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="MUX53" description="MUX53 Configuration for OUT1 of EPWM-XBAR" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="MUX54" description="MUX54 Configuration for OUT1 of EPWM-XBAR" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="MUX55" description="MUX55 Configuration for OUT1 of EPWM-XBAR" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="MUX56" description="MUX56 Configuration for OUT1 of EPWM-XBAR" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="MUX57" description="MUX57 Configuration for OUT1 of EPWM-XBAR" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="MUX58" description="MUX58 Configuration for OUT1 of EPWM-XBAR" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="MUX59" description="MUX59 Configuration for OUT1 of EPWM-XBAR" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="MUX60" description="MUX60 Configuration for OUT1 of EPWM-XBAR" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="MUX61" description="MUX61 Configuration for OUT1 of EPWM-XBAR" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="MUX62" description="MUX62 Configuration for OUT1 of EPWM-XBAR" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="MUX63" description="MUX63 Configuration for OUT1 of EPWM-XBAR" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
