IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_epwm_xbar_regs.xml
	<register id="OUT8MUXENABLE" width="32" page="1" offset="0x5c" internal="0" description="ePWM XBAR Mux Enable for Output8">
		<bitfield id="MUX0" description="MUX0 to drive OUT8 of EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MUX1" description="MUX1 to drive OUT8 of EPWM-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUX2" description="MUX2 to drive OUT8 of EPWM-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MUX3" description="MUX3 to drive OUT8 of EPWM-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MUX4" description="MUX4 to drive OUT8 of EPWM-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MUX5" description="MUX5 to drive OUT8 of EPWM-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MUX6" description="MUX6 to drive OUT8 of EPWM-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MUX7" description="MUX7 to drive OUT8 of EPWM-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MUX8" description="MUX8 to drive OUT8 of EPWM-XBAR" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MUX9" description="MUX9 to drive OUT8 of EPWM-XBAR" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MUX10" description="MUX10 to drive OUT8 of EPWM-XBAR" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MUX11" description="MUX11 to drive OUT8 of EPWM-XBAR" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MUX12" description="MUX12 to drive OUT8 of EPWM-XBAR" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MUX13" description="MUX13 to drive OUT8 of EPWM-XBAR" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MUX14" description="MUX14 to drive OUT8 of EPWM-XBAR" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MUX15" description="MUX15 to drive OUT8 of EPWM-XBAR" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MUX16" description="MUX16 to drive OUT8 of EPWM-XBAR" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MUX17" description="MUX17 to drive OUT8 of EPWM-XBAR" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MUX18" description="MUX18 to drive OUT8 of EPWM-XBAR" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MUX19" description="MUX19 to drive OUT8 of EPWM-XBAR" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MUX20" description="MUX20 to drive OUT8 of EPWM-XBAR" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MUX21" description="MUX21 to drive OUT8 of EPWM-XBAR" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MUX22" description="MUX22 to drive OUT8 of EPWM-XBAR" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MUX23" description="MUX23 to drive OUT8 of EPWM-XBAR" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MUX24" description="MUX24 to drive OUT8 of EPWM-XBAR" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MUX25" description="MUX25 to drive OUT8 of EPWM-XBAR" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MUX26" description="MUX26 to drive OUT8 of EPWM-XBAR" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MUX27" description="MUX27 to drive OUT8 of EPWM-XBAR" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MUX28" description="MUX28 to drive OUT8 of EPWM-XBAR" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MUX29" description="MUX29 to drive OUT8 of EPWM-XBAR" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MUX30" description="MUX30 to drive OUT8 of EPWM-XBAR" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MUX31" description="MUX31 to drive OUT8 of EPWM-XBAR" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="OUT8MUXENABLE32TO64" width="32" page="1" offset="0x5e" internal="0" description="ePWM XBAR Mux Enable for Output8">
		<bitfield id="MUX32" description="MUX32 to drive OUT8 of EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MUX33" description="MUX33 to drive OUT8 of EPWM-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MUX34" description="MUX34 to drive OUT8 of EPWM-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MUX35" description="MUX35 to drive OUT8 of EPWM-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MUX36" description="MUX36 to drive OUT8 of EPWM-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MUX37" description="MUX37 to drive OUT8 of EPWM-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MUX38" description="MUX38 to drive OUT8 of EPWM-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MUX39" description="MUX39 to drive OUT8 of EPWM-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="MUX40" description="MUX40 to drive OUT8 of EPWM-XBAR" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MUX41" description="MUX41 to drive OUT8 of EPWM-XBAR" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="MUX42" description="MUX42 to drive OUT8 of EPWM-XBAR" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="MUX43" description="MUX43 to drive OUT8 of EPWM-XBAR" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="MUX44" description="MUX44 to drive OUT8 of EPWM-XBAR" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="MUX45" description="MUX45 to drive OUT8 of EPWM-XBAR" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="MUX46" description="MUX46 to drive OUT8 of EPWM-XBAR" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="MUX47" description="MUX47 to drive OUT8 of EPWM-XBAR" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="MUX48" description="MUX48 to drive OUT8 of EPWM-XBAR" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="MUX49" description="MUX49 to drive OUT8 of EPWM-XBAR" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="MUX50" description="MUX50 to drive OUT8 of EPWM-XBAR" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="MUX51" description="MUX51 to drive OUT8 of EPWM-XBAR" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="MUX52" description="MUX52 to drive OUT8 of EPWM-XBAR" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="MUX53" description="MUX53 to drive OUT8 of EPWM-XBAR" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="MUX54" description="MUX54 to drive OUT8 of EPWM-XBAR" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="MUX55" description="MUX55 to drive OUT8 of EPWM-XBAR" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="MUX56" description="MUX56 to drive OUT8 of EPWM-XBAR" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MUX57" description="MUX57 to drive OUT8 of EPWM-XBAR" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="MUX58" description="MUX58 to drive OUT8 of EPWM-XBAR" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="MUX59" description="MUX59 to drive OUT8 of EPWM-XBAR" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="MUX60" description="MUX60 to drive OUT8 of EPWM-XBAR" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="MUX61" description="MUX61 to drive OUT8 of EPWM-XBAR" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="MUX62" description="MUX62 to drive OUT8 of EPWM-XBAR" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="MUX63" description="MUX63 to drive OUT8 of EPWM-XBAR" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="TRIPOUTINV" width="32" page="1" offset="0x68" internal="0" description="ePWM XBAR Output Inversion Register">
		<bitfield id="OUT0" description="Selects polarity for OUT0 of EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="OUT1" description="Selects polarity for OUT1 of EPWM-XBAR" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OUT2" description="Selects polarity for OUT2 of EPWM-XBAR" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="OUT3" description="Selects polarity for OUT3 of EPWM-XBAR" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="OUT4" description="Selects polarity for OUT4 of EPWM-XBAR" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="OUT5" description="Selects polarity for OUT5 of EPWM-XBAR" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="OUT6" description="Selects polarity for OUT6 of EPWM-XBAR" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="OUT7" description="Selects polarity for OUT7 of EPWM-XBAR" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="TRIPLOCK" width="32" page="1" offset="0x6e" internal="0" description="ePWM XBAR Configuration Lock register">
		<bitfield id="LOCK" description="Locks the configuration for EPWM-XBAR" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Write protection KEY" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
